<template>
  <div class="basic_container">
    <!-- <div class="read_process_outer">
      <div class="read_process_inner"></div>
    </div> -->
    <header>
      <h2>中华人民共和国应急管理部令第7号</h2>
    </header>
    <mark>
      <p>《社会消防技术服务管理规定》已经2021年8月17日应急管理部第27次部务会议审议通过，现予公布，自2021年11月9日起施行。</p>
      <div class="right">部长黄明</div>
      <div class="right">2021年9月13日</div>
    </mark>
    <main>
      <summary>
        <h3>社会消防技术服务管理规定</h3>
      </summary>
      <section>
        <!-- <summary> -->
          <h4>第一章总则</h4>
        <!-- </summary>
        <details> -->
          <p>第一条为规范社会消防技术服务活动，维护消防技术服务市场秩序，促进提高消防技术服务质量，根据《中华人民共和国消防法》，制定本规定。</p>
          <p>第二条在中华人民共和国境内从事社会消防技术服务活动、对消防技术服务机构实施监督管理，适用本规定。</p>
          <p>本规定所称消防技术服务机构是指从事消防设施维护保养检测、消防安全评估等社会消防技术服务活动的企业。</p>
          <p>第三条消防技术服务机构及其从业人员开展社会消防技术服务活动应当遵循客观独立、合法公正、诚实信用的原则。</p>
          <p>本规定所称消防技术服务从业人员，是指依法取得注册消防工程师资格并在消防技术服务机构中执业的专业技术人员，以及按照有关规定取得相应消防行业特有工种职业资格，在消防技术服务机构中从事社会消防技术服务活动的人员。</p>
          <p>第四条消防技术服务行业组织应当加强行业自律管理，规范从业行为，促进提升服务质量。</p>
          <p>消防技术服务行业组织不得从事营利性社会消防技术服务活动，不得从事或者通过消防技术服务机构进行行业垄断。</p>
        <!-- </details> -->
      </section>
      <section>
        <!-- <summary> -->
          <h4>第二章从业条件</h4>
        <!-- </summary> -->
        <!-- <details> -->
          <p>第五条从事消防设施维护保养检测的消防技术服务机构，应当具备下列条件：</p>
          <p>（一）取得企业法人资格；</p>
          <p>（二）工作场所建筑面积不少于200平方米；</p>
          <p>（三）消防技术服务基础设备和消防设施维护保养检测设备配备符合有关规定要求；</p>
          <p>（四）注册消防工程师不少于2人，其中一级注册消防工程师不少于1人；</p>
          <p>（五）取得消防设施操作员国家职业资格证书的人员不少于6人，其中中级技能等级以上的不少于2人；</p>
          <p>（六）健全的质量管理体系。</p>
          <p>第六条从事消防安全评估的消防技术服务机构，应当具备下列条件：</p>
          <p>（一）取得企业法人资格；</p>
          <p>（二）工作场所建筑面积不少于100平方米；</p>
          <p>（三）消防技术服务基础设备和消防安全评估设备配备符合有关规定要求；</p>
          <p>（四）注册消防工程师不少于2人，其中一级注册消防工程师不少于1人；</p>
          <p>（五）健全的消防安全评估过程控制体系。</p>
          <p>第七条同时从事消防设施维护保养检测、消防安全评估的消防技术服务机构，应当具备下列条件：</p>
          <p>（一）取得企业法人资格；</p>
          <p>（二）工作场所建筑面积不少于200平方米；</p>
          <p>（三）消防技术服务基础设备和消防设施维护保养检测、消防安全评估设备配备符合规定的要求；</p>
          <p>（四）注册消防工程师不少于2人，其中一级注册消防工程师不少于1人；</p>
          <p>（五）取得消防设施操作员国家职业资格证书的人员不少于6人，其中中级技能等级以上的不少于2人；</p>
          <p>（六）健全的质量管理和消防安全评估过程控制体系。</p>
          <p>第八条消防技术服务机构可以在全国范围内从业。</p>
        <!-- </details> -->
      </section>
      <section>
        <!-- <summary> -->
          <h4>第三章社会消防技术服务活动</h4>
        <!-- </summary> -->
        <!-- <details> -->
          <p>第九条消防技术服务机构及其从业人员应当依照法律法规、技术标准和从业准则，开展下列社会消防技术服务活动，并对服务质量负责：</p>
          <p>（一）消防设施维护保养检测机构可以从事建筑消防设施维护保养、检测活动；</p>
          <p>（二）消防安全评估机构可以从事区域消防安全评估、社会单位消防安全评估、大型活动消防安全评估等活动，以及消防法律法规、消防技术标准、火灾隐患整改、消防安全管理、消防宣传教育等方面的咨询活动。</p>
          <p>消防技术服务机构出具的结论文件，可以作为消防救援机构实施消防监督管理和单位（场所）开展消防安全管理的依据。</p>
        <!-- </details> -->
      </section>
      <section>
        <!-- <summary> -->
          <h4>第四章从业条件</h4>
        <!-- </summary> -->
        <!-- <details> -->
          <p>第五条从事消防设施维护保养检测的消防技术服务机构，应当具备下列条件：</p>
          <p>（一）取得企业法人资格；</p>
          <p>（二）工作场所建筑面积不少于200平方米；</p>
          <p>（三）消防技术服务基础设备和消防设施维护保养检测设备配备符合有关规定要求；</p>
          <p>（四）注册消防工程师不少于2人，其中一级注册消防工程师不少于1人；</p>
          <p>（五）取得消防设施操作员国家职业资格证书的人员不少于6人，其中中级技能等级以上的不少于2人；</p>
          <p>（六）健全的质量管理体系。</p>
          <p>第六条从事消防安全评估的消防技术服务机构，应当具备下列条件：</p>
          <p>（一）取得企业法人资格；</p>
          <p>（二）工作场所建筑面积不少于100平方米；</p>
          <p>（三）消防技术服务基础设备和消防安全评估设备配备符合有关规定要求；</p>
          <p>（四）注册消防工程师不少于2人，其中一级注册消防工程师不少于1人；</p>
          <p>（五）健全的消防安全评估过程控制体系。</p>
          <p>第七条同时从事消防设施维护保养检测、消防安全评估的消防技术服务机构，应当具备下列条件：</p>
          <p>（一）取得企业法人资格；</p>
          <p>（二）工作场所建筑面积不少于200平方米；</p>
          <p>（三）消防技术服务基础设备和消防设施维护保养检测、消防安全评估设备配备符合规定的要求；</p>
          <p>（四）注册消防工程师不少于2人，其中一级注册消防工程师不少于1人；</p>
          <p>（五）取得消防设施操作员国家职业资格证书的人员不少于6人，其中中级技能等级以上的不少于2人；</p>
          <p>（六）健全的质量管理和消防安全评估过程控制体系。</p>
          <p>第八条消防技术服务机构可以在全国范围内从业。</p>
        <!-- </details> -->
      </section>
    </main>
  </div>
</template>
<script>

</script>
<style lang="scss" scoped>
.basic_container{
  /* width: 98vw; */
  height: 100vh;
  /* padding: 5px 20px; */
  background: linear-gradient(to right top, #0089f2 50%, #DDD 50%);
  /* 通过 calc 函数配合 100vh 就可以从总长中删除一屏的高度 */
  /* 100vh 浏览器视口的高度 */
  background-size: 100% calc(100% - 100vh + 4px);
  background-repeat: no-repeat;


  h2:first-child, h3:first-child{
    text-align: center
  }
  p{
    padding-left: 40px;
  }
  .right{
    text-align: right
  }
  /* .read_process_outer{
    width: 100vw;
    height: 6px;
    position: fixed;
    top: 0px;
    left: 20px;
    background-color:azure;
  }
  .read_process_inner{
    position: absolute;
    top: 0px;
    left: 0px;
    height: 100%;
    background-color: blueviolet;
  } */
}
.basic_container::before{
    content:'';
    /* fixed定位 */
    position: fixed;
    /* 同时设置 top 和 bottom 可以拉伸 height */
    /* 设置高度为 100% - 3px */
    top: 6px;
    bottom: 0;
    width: 100%;
    /* 降低层级，白块显示在文字之下 */
    z-index: -1;
    background: white;
}

</style>